#pragma once

#include <string>
#include <vector>
#include <array>

namespace Common
{
    const std::array<std::string, 9> FONT_A = {
        "  ▄████████ ",
        "  ███    ███",
        "  ███    ███",
        "  ███    ███",
        "▀███████████",
        "  ███    ███",
        "  ███    ███",
        "  ███    █▀ ",
        "            ",
    };

    const std::array<std::string, 9> FONT_B = {
        "▀█████████▄  ",
        "   ███    ███",
        "   ███    ███",
        "  ▄███▄▄▄██▀ ",
        "▀▀███▀▀▀██▄  ",
        "   ███    ██▄",
        "   ███    ███",
        "▄█████████▀  ",
        "             "
    };

    const std::array<std::string, 9> FONT_C = {
        " ▄████████",
        "███    ███",
        "███    █▀ ",
        "███       ",
        "███       ",
        "███    █▄ ",
        "███    ███",
        "████████▀ ",
        "          "
    };

    const std::array<std::string, 9> FONT_D = {
        "████████▄ ",
        "███   ▀███",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        "███   ▄███",
        "████████▀ ",
        "          "
    };

    const std::array<std::string, 9> FONT_E = {
        "   ▄████████",
        "  ███    ███",
        "  ███    █▀ ",
        " ▄███▄▄▄    ",
        "▀▀███▀▀▀    ",
        "  ███    █▄ ",
        "  ███    ███",
        "  ██████████",
        "            "
    };

    const std::array<std::string, 9> FONT_F = {
        "   ▄████████",
        "  ███    ███",
        "  ███    █▀ ",
        " ▄███▄▄▄    ",
        "▀▀███▀▀▀    ",
        "  ███       ",
        "  ███       ",
        "  ███       ",
        "            "
    };

    const std::array<std::string, 9> FONT_G = {
        "   ▄██████▄ ",
        "  ███    ███",
        "  ███    █▀ ",
        " ▄███       ",
        "▀▀███ ████▄ ",
        "  ███    ███",
        "  ███    ███",
        "  ████████▀ ",
        "            "
    };

    const std::array<std::string, 9> FONT_H = {
        "   ▄█    █▄   ",
        "  ███    ███  ",
        "  ███    ███  ",
        " ▄███▄▄▄▄███▄▄",
        "▀▀███▀▀▀▀███▀ ",
        "  ███    ███  ",
        "  ███    ███  ",
        "  ███    █▀   ",
        "              "
    };

    const std::array<std::string, 9> FONT_I = {
        " ▄█ ",
        "███ ",
        "███▌",
        "███▌",
        "███▌",
        "███ ",
        "███ ",
        "█▀  ",
        "    "
    };

    const std::array<std::string, 9> FONT_J = {
        "     ▄█",
        "    ███",
        "    ███",
        "    ███",
        "    ███",
        "    ███",
        "    ███",
        "█▄ ▄███",
        "▀▀▀▀▀▀ "
    };

    const std::array<std::string, 9> FONT_K = {
        "   ▄█   ▄█▄",
        "  ███ ▄███▀",
        "  ███▐██▀  ",
        " ▄█████▀   ",
        "▀▀█████▄   ",
        "  ███▐██▄  ",
        "  ███ ▀███▄",
        "  ███   ▀█▀",
        "  ▀        "
    };

    const std::array<std::string, 9> FONT_L = {
        " ▄█      ",
        "███      ",
        "███      ",
        "███      ",
        "███      ",
        "███      ",
        "███▌    ▄",
        "█████▄▄██",
        "▀        "
    };

    const std::array<std::string, 9> FONT_M = {
        "   ▄▄▄▄███▄▄▄▄  ",
        " ▄██▀▀▀███▀▀▀██▄",
        " ███   ███   ███",
        " ███   ███   ███",
        " ███   ███   ███",
        " ███   ███   ███",
        " ███   ███   ███",
        "  ▀█   ███   █▀ ",
        "                "
    };

    const std::array<std::string, 9> FONT_N = {
        "███▄▄▄▄  ",
        "███▀▀▀██▄",
        "███   ███",
        "███   ███",
        "███   ███",
        "███   ███",
        "███   ███",
        " ▀█   █▀ ",
        "          "
    };

    const std::array<std::string, 9> FONT_O = {
        " ▄██████▄ ",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        " ▀██████▀ ",
        "          "
    };

    const std::array<std::string, 9> FONT_P = {
        "   ▄███████▄",
        "  ███    ███",
        "  ███    ███",
        "  ███    ███",
        "▀█████████▀ ",
        "  ███       ",
        "  ███       ",
        " ▄████▀     ",
        "            "
    };

    const std::array<std::string, 9> FONT_Q = {
        "████████▄  ",
        "███    ███ ",
        "███    ███ ",
        "███    ███ ",
        "███    ███ ",
        "███    ███ ",
        "███  ▀ ███ ",
        " ▀██████▀▄█",
        "           "
    };

    const std::array<std::string, 9> FONT_R = {
        "   ▄████████",
        "  ███    ███",
        "  ███    ███",
        " ▄███▄▄▄▄██▀",
        "▀▀███▀▀▀▀▀  ",
        "▀███████████",
        "  ███    ███",
        "  ███    ███",
        "  ███    ███"
    };

    const std::array<std::string, 9> FONT_S = {
        "   ▄████████",
        "  ███    ███",
        "  ███    █▀ ",
        "  ███       ",
        "▀███████████",
        "         ███",
        "   ▄█    ███",
        " ▄████████▀ ",
        "            "
    };

    const std::array<std::string, 9> FONT_T = {
        "    ███    ",
        "▀█████████▄",
        "   ▀███▀▀██",
        "    ███   ▀",
        "    ███    ",
        "    ███    ",
        "    ███    ",
        "   ▄████▀  ",
        "           "
    };

    const std::array<std::string, 9> FONT_U = {
        "███    █▄ ",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        "████████▀ ",
        "          "
    };

    const std::array<std::string, 9> FONT_V = {
        " ▄█    █▄ ",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        "███    ███",
        " ▀██████▀ ",
        "          "
    };

    const std::array<std::string, 9> FONT_W = {
        " ▄█     █▄ ",
        "███     ███",
        "███     ███",
        "███     ███",
        "███     ███",
        "███     ███",
        "███ ▄█▄ ███",
        " ▀███▀███▀ ",
        "           "
    };

    const std::array<std::string, 9> FONT_X = {
        "▀████    ▐████▀",
        "  ███▌   ████▀ ",
        "   ███  ▐███   ",
        "   ▀███▄███▀   ",
        "   ████▀██▄    ",
        "  ▐███  ▀███   ",
        " ▄███     ███▄ ",
        "████       ███▄",
        "               "
    };

    const std::array<std::string, 9> FONT_Y = {
        "▄██   ▄  ",
        "███   ██▄",
        "███▄▄▄███",
        "▀▀▀▀▀▀███",
        "▄██   ███",
        "███   ███",
        "███   ███",
        " ▀█████▀ ",
        "         "
    };

    const std::array<std::string, 9> FONT_Z = {
        " ▄███████▄ ",
        "██▀     ▄██",
        "      ▄███▀",
        " ▀█▀▄███▀▄▄",
        "  ▄███▀   ▀",
        "▄███▀      ",
        "███▄     ▄█",
        " ▀████████▀",
        "           "
    };

    const std::array<std::string, 9> FONT_BLANK = {
        "   ",
        "   ",
        "   ",
        "   ",
        "   ",
        "   ",
        "   ",
        "   ",
        "   "
    };


    const std::array<std::string, 9> FONT_DOT = {
        "  ",
        "  ",
        "  ",
        "  ",
        "  ",
        "  ",
        "  ",
        "  ",
        "██"
    };

        const std::array<std::string, 4> FONT_a = {
            " ██ ",
            "█  █",
            "████",
            "█  █"
        };

        const std::array<std::string, 4> FONT_b = {
            "█   ",
            "███ ",
            "█  █",
            "███ "
        };

        const std::array<std::string, 4> FONT_c = {
            " ███",
            "█   ",
            "█   ",
            " ███"
        };

        const std::array<std::string, 4> FONT_d = {
            "   █",
            " ███",
            "█  █",
            " ███"
        };

        const std::array<std::string, 4> FONT_e = {
            " ██ ",
            "████",
            "█   ",
            " ███"
        };

        const std::array<std::string, 4> FONT_f = {
            " ███",
            "██  ",
            "█   ",
            "█   "
        };

        const std::array<std::string, 4> FONT_g = {
            " ███",
            "█  █",
            " ███",
            "   █"
        };

        const std::array<std::string, 4> FONT_h = {
            "█   ",
            "███ ",
            "█  █",
            "█  █"
        };

        const std::array<std::string, 4> FONT_i = {
            "█",
            "█",
            "█",
            "█"
        };

        const std::array<std::string, 4> FONT_j = {
            "  █",
            "  █",
            "█ █",
            " █ "
        };

        const std::array<std::string, 4> FONT_k = {
            "█  █",
            "█ █ ",
            "██  ",
            "█ █ "
        };

        const std::array<std::string, 4> FONT_l = {
            "██",
            " █",
            " █",
            "██"
        };

        const std::array<std::string, 4> FONT_m = {
            "     ",
            "██ ██",
            "█ █ █",
            "█   █"
        };

        const std::array<std::string, 4> FONT_n = {
            "███ ",
            "█  █",
            "█  █",
            "█  █"
        };

        const std::array<std::string, 4> FONT_o = {
            " ██ ",
            "█  █",
            "█  █",
            " ██ "
        };

        const std::array<std::string, 4> FONT_p = {
            "███ ",
            "█  █",
            "███ ",
            "█   "
        };

        const std::array<std::string, 4> FONT_q = {
            " ███",
            "█  █",
            " ███",
            "   █"
        };

        const std::array<std::string, 4> FONT_r = {
            "█ ██",
            "██  ",
            "█   ",
            "█   "
        };

        const std::array<std::string, 4> FONT_s = {
            " ███",
            "██  ",
            "  ██",
            "███ "
        };

        const std::array<std::string, 4> FONT_t = {
            " █  ",
            "███ ",
            " █  ",
            "  ██"
        };

        const std::array<std::string, 4> FONT_u = {
            "█  █",
            "█  █",
            "█  █",
            " ███"
        };

        const std::array<std::string, 4> FONT_v = {
            "█  █",
            "█  █",
            " ██ ",
            " ██ "
        };

        const std::array<std::string, 4> FONT_w = {
            "█   █",
            "█   █",
            "█ █ █",
            " █ █ "
        };

        const std::array<std::string, 4> FONT_x = {
            "█  █",
            " ██ ",
            " ██ ",
            "█  █"
        };

        const std::array<std::string, 4> FONT_y = {
            "█  █",
            "█  █",
            " ███",
            "   █"
        };

        const std::array<std::string, 4> FONT_z = {
            "████",
            "  █ ",
            " █  ",
            "████"
        };


    inline std::array<std::string, 9> ConcatFont(std::vector<std::array<std::string, 9>> fontChar, int separator) {
        std::array<std::string, 9> result { "", "", "", "", "", "", "", "", "" };
        std::string sep = "";
        for (int i = 0; i < separator; i++) {
            sep += " ";
        }
        for (int i = 0; i < 9; i++) {
            for (int j = 0; j < fontChar.size(); j++) {
                result[i] += fontChar[j][i] + sep;
            }
        }
        return result;
    }
}
